Tester/src/InformationRegisters/UsersAndGroups/UsersAndGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>UsersAndGroups</name>
  <dimensions>
    <name>UserGroup</name>
    <comment>Нельзя использовать имя Group</comment>
    <type>
      <types>CatalogRef.UserGroups</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Agent</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApplicationsAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Applications</name>
    <attributes>
      <name>Application</name>
      <type>
        <types>CatalogRef.Applications</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Managers</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/Catalogs/UserGroups/UserGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>UserGroups</name>
  <predefined>
    <items>
      <name>Users</name>
      <description>Users</description>
    </items>
  </predefined>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/CommonModules/LoginsSrv/Module.bsl
Procedure ChangePassword ( NewPassword ) export
	
	SetPrivilegedMode ( true );
	name = UserName ();
	user = InfoBaseUsers.FindByName ( name );
	user.Password = NewPassword;
	user.Write ();
	SetPrivilegedMode ( false );
	
EndProcedure 

Procedure SetRights ( User ) export
	
	roles = getUserRoles ( User.Name );
	assingRoles ( User, roles );
	
EndProcedure 

Function getUserRoles ( UserName )
	
	s = "
	|select Rights.RoleName as RoleName
	|from Catalog.Users.Rights as Rights
	|where Rights.Ref = &User
	|union
	|select Rights.RoleName
	|from Catalog.UserGroups.Rights as Rights
	|	//
	|	// UsersAndGroups
	|	//
	|	join InformationRegister.UsersAndGroups as UsersAndGroups
	|	on UsersAndGroups.User = &User
	|	and UsersAndGroups.UserGroup = Rights.Ref
	|where not Rights.Ref.DeletionMark
	|";
	q = new Query ( s );
	user = Catalogs.Users.FindByDescription ( UserName, true );
	q.SetParameter ( "User", user );
	return q.Execute ().Unload ().UnloadColumn ( "RoleName" );
	
EndFunction 

Procedure assingRoles ( User, Roles )
	
	userRoles = User.Roles;
	userRoles.Clear ();
	userRoles.Add ( Metadata.Roles.User );
	for each roleName in Roles do
		role = Metadata.Roles.Find ( roleName );
		if ( role <> undefined ) then
			userRoles.Add ( role );
		endif; 
	enddo; 
	
EndProcedure 

Procedure Remove ( UserName ) export
	
	user = InfoBaseUsers.FindByName ( UserName );
	if ( user = undefined ) then
		return;
	endif; 
	user.Delete ();
	
EndProcedure 

Function LastAdministrator () export
	
	if ( findAdmin () ) then
		return false;
	endif;
	Output.AdministratorNotFound ();
	return true;
	
EndFunction 

Function findAdmin ()
	
	s = "
	|select top 1 1
	|from Catalog.Users.Rights as Rights
	|where Rights.RoleName = ""Administrator""
	|and not Rights.Ref.DeletionMark
	|and not Rights.Ref.AccessDenied
	|union
	|select top 1 1
	|from Catalog.UserGroups.Rights as Rights
	|	//
	|	// UsersAndGroups
	|	//
	|	join InformationRegister.UsersAndGroups as UsersAndGroups
	|	on UsersAndGroups.UserGroup = Rights.Ref
	|	and not UsersAndGroups.User.DeletionMark
	|	and not UsersAndGroups.User.AccessDenied
	|where Rights.RoleName = ""Administrator""
	|and not Rights.Ref.DeletionMark
	|";
	q = new Query ( s );
	found = not q.Execute ().IsEmpty ();
	return found;
	
EndFunction

Procedure SaveSettings ( ObjectKey, SettingsKey = undefined, Settings ) export
	
	if ( AccessRight ( "SaveUserData", Metadata ) ) then
		CommonSettingsStorage.Save ( ObjectKey, SettingsKey, Settings );
	endif; 
	
EndProcedure
